vlm/extension/Documents/ПроизводственнаяОперация2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПроизводственнаяОперация2_2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификаторОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_СрокСдачиЗаказчику</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ДатаРасчетаСрокаЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ОбщийСрокИзготовленияЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_СрокИзготовления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_ДатаИзготовления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/Documents/ПроизводственнаяОперация2_2/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.29]  [VUVaynula@1cbit.ru] [13.08.2025 22:24:56] +        
	ДобавляемыеРеквизиты = Новый Массив;
	НовыйРеквизит = Новый РеквизитФормы("бит_КомментарийЗаказаКлиента", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000))); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);   
	НовыйРеквизит = Новый РеквизитФормы("бит_ЗаказКлиента", Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента")); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);   
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 

	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_КомментарийЗаказаКлиента", Тип("ПолеФормы"), Элементы.СтраницаОсновное);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "бит_КомментарийЗаказаКлиента";
	НовыйЭлемент.Заголовок = "(бит) Комментарий заказа клиента";
	НовыйЭлемент.МногострочныйРежим = Истина; 
	НовыйЭлемент.ТолькоПросмотр = Истина;
	ЭтаФорма.бит_ЗаказКлиента = Заполнить_бит_КомментарийЗаказаКлиента(); 
	ЗаполнитьТаруНаСервере(ЭтаФорма.бит_ЗаказКлиента);
	// }}ПервыйБИТ ЛистТребований [ЛТ5.29]  [VUVaynula@1cbit.ru] [13.08.2025 22:24:56] -
	
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [18.08.2025] +        
	
	//*
	НоваяГруппа = Этаформа.Элементы.Вставить("бит_НоваяГруппаВремяВыполнения", Тип("ГруппаФормы"), ЭтаФорма.Элементы.СтраницаОсновное, Неопределено);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Заголовок = "бит_НоваяГруппаВремяВыполнения";
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ВремяВыполненияПлан", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ВремяВыполненияПлан";
	НовыйЭлемент.Ширина = 7;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ВремяВыполненияПланПриИзменении");
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ВремяВыполненияПланЕдИзм", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Ширина = 4;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ВремяВыполненияПланЕдИзм";
	
	//*
	НоваяГруппа = Этаформа.Элементы.Вставить("бит_НоваяГруппаКоличествоПлан", Тип("ГруппаФормы"), ЭтаФорма.Элементы.СтраницаОсновное, Неопределено);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Заголовок = "бит_НоваяГруппаКоличествоПлан";
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_КоличествоПлан", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_КоличествоПлан";
	НовыйЭлемент.Ширина = 7;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "КоличествоПланПриИзменении");
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_КоличествоПланЕдИзм", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Ширина = 4;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_КоличествоПланЕдИзм";
		
	//*
	НоваяГруппа = Этаформа.Элементы.Вставить("бит_НоваяГруппаВыполнениеПоВыпуску", Тип("ГруппаФормы"), ЭтаФорма.Элементы.СтраницаОсновное, Неопределено);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Заголовок = "бит_НоваяГруппаВыполнениеПоВыпуску";
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ВыполнениеПоВыпускуПроцент", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ВыполнениеПоВыпускуПроцент";
	НовыйЭлемент.Ширина = 7;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ПричинаЗаниженияНормыВыпуска", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ПричинаЗаниженияНормыВыпуска";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_Выполнено100ПроцентовВыпуска", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Доступность = Ложь;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Выполнено100ПроцентовВыпуска";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Выполнено100ПроцентовВыпускаПриИзменении");
	
	//*
	НоваяГруппа = Этаформа.Элементы.Вставить("бит_НоваяГруппаВыполнениеПоВремени", Тип("ГруппаФормы"), ЭтаФорма.Элементы.СтраницаОсновное, Неопределено);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Заголовок = "бит_НоваяГруппаВыполнениеПоВремени";
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ВыполнениеПоВремениПроцент", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ВыполнениеПоВремениПроцент";
	НовыйЭлемент.Ширина = 7;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ПричинаЗаниженияНормыВремени", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ПричинаЗаниженияНормыВремени";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_Выполнено100ПроцентовВремени", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Доступность = Ложь;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Выполнено100ПроцентовВремени";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Выполнено100ПроцентовВремениПриИзменении");
	
	//*
	НоваяГруппа = Этаформа.Элементы.Вставить("бит_НоваяГруппаОборудование", Тип("ГруппаФормы"), ЭтаФорма.Элементы.СтраницаОсновное, Неопределено);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Заголовок = "бит_НоваяГруппаОборудование";
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ДополнительноеОборудование", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ДополнительноеОборудование";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_Сверхурочное", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Сверхурочное";
		
	Если РольДоступна("бит_ИзменениеПлановыхПоказателейДляРасчетаЗаработнойПлаты")
		ИЛИ РольДоступна("ПолныеПрава")
		ИЛИ РольДоступна("АдминистраторСистемы") Тогда
		
		Элементы["бит_ВремяВыполненияПлан"].ТолькоПросмотр = Ложь;
		Элементы["бит_ВремяВыполненияПланЕдИзм"].ТолькоПросмотр = Ложь;
		Элементы["бит_КоличествоПлан"].ТолькоПросмотр = Ложь;
		Элементы["бит_КоличествоПланЕдИзм"].ТолькоПросмотр = Ложь;
				
	КонецЕсли; 
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.Выполнена")
		ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.НеВыполнена") Тогда
		
		Элементы["бит_Выполнено100ПроцентовВыпуска"].Доступность = Истина;
		Элементы["бит_Выполнено100ПроцентовВремени"].Доступность = Истина;
		
	КонецЕсли;
	
	Если РольДоступна("бит_Установка100ПроцентовВыполненияОперации")
		ИЛИ РольДоступна("ПолныеПрава")
		ИЛИ РольДоступна("АдминистраторСистемы") Тогда
		
		Элементы["бит_Выполнено100ПроцентовВыпуска"].ТолькоПросмотр = Ложь;
		Элементы["бит_Выполнено100ПроцентовВремени"].ТолькоПросмотр = Ложь;		
			
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [18.08.2025] -
	
КонецПроцедуры

&НаСервере
Функция Заполнить_бит_КомментарийЗаказаКлиента(ПерезаполнятьКомментарий = Истина)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.29]  [VUVaynula@1cbit.ru] [13.08.2025 22:37:41] +        
	Если Не ЗначениеЗаполнено(Объект.Этап) // нет этапа - нет назначения
		//Или ЗначениеЗаполнено(Объект.Этап.Этап) // если у этапа заполнен этап значит он в иерархии. значит ничего не заполняем. "
		Тогда 
		Возврат Документы.ЗаказКлиента.ПустаяСсылка();
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ЭтапПроизводства2_2ВыходныеИзделия.Назначение.Заказ КАК НазначениеЗаказ
	                      |ИЗ
	                      |	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	                      |ГДЕ
	                      |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = &Этап
	                      |	И ЭтапПроизводства2_2ВыходныеИзделия.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)"); 
	Запрос.УстановитьПараметр("Этап", Объект.Этап);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Количество() = 1 Тогда 
		Результат.Следующий();
		Заказ = Результат.НазначениеЗаказ; 
		//ЭтаФорма.бит_ЗаказКлиента = Заказ;
		Если ЗначениеЗаполнено(Заказ) И ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказКлиента") И ПерезаполнятьКомментарий Тогда
			ЭтаФорма.бит_КомментарийЗаказаКлиента = Заказ.Комментарий;
		КонецЕсли;
	КонецЕсли;
	Возврат Заказ;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.29]  [VUVaynula@1cbit.ru] [13.08.2025 22:37:41] -
КонецФункции

&НаКлиенте
Процедура КоличествоПланПриИзменении(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] +        
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.Выполнена") Тогда
		РасчитатьПроцентВыполнениеПоВыпуску();
	КонецЕсли;
	 	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] -
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяВыполненияПланПриИзменении(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] +        
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.Выполнена") Тогда
		РасчитатьПроцентВыполнениеПоВремени();
	КонецЕсли;
	 	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_СтатусПриИзмененииПосле(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] +        
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.Выполнена")
		ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.НеВыполнена") Тогда
		
		Элементы["бит_Выполнено100ПроцентовВыпуска"].Доступность = Истина;
		Элементы["бит_Выполнено100ПроцентовВремени"].Доступность = Истина;
		
	Иначе
		
		Элементы["бит_Выполнено100ПроцентовВыпуска"].Доступность = Ложь;
		Элементы["бит_Выполнено100ПроцентовВремени"].Доступность = Ложь;
		
	КонецЕсли;
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.Выполнена") Тогда 
		//И ПолучитьРеквизитСсылкиОбъекта("Статус") <> ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.Выполнена") Тогда
		
		РасчитатьПроцентВыполнениеПоВыпуску();
		РасчитатьПроцентВыполнениеПоВремени();
		
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.НеВыполнена") Тогда
		
		// 4.При установке статуса документа "Не выполнена" устанавливать значение реквизитов 
		// "(бит)Выполнение по времени, %" =0 и "(бит)Выполнение по выпуску, %" = 0
		Объект.бит_ВыполнениеПоВремениПроцент = 0;
		Объект.бит_ВыполнениеПоВыпускуПроцент = 0;
		
	ИначеЕсли Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.Выполнена")
		И Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.НеВыполнена") Тогда 
		//И ПолучитьРеквизитСсылкиОбъекта("Статус") <> Объект.Статус Тогда	
			
		//5. При установке любых других статусов документа, кроме "Выполнена" и "Не выполнена", требуется производить очистку реквизитов (если они заполнены):
		//	
		//	(бит)"Выполнение по выпуску, %"
		//	(бит)"Выполнение по времени, %"
		//	(бит)Причина занижения нормы выпуска
		//	(бит)Причина занижения нормы времени
		//	(бит)Выполнено 100% выпуска
		//	(бит)Выполнено 100% времени	
		
		Объект.бит_ВыполнениеПоВыпускуПроцент = Неопределено;
		Объект.бит_ВыполнениеПоВремениПроцент = Неопределено;
		Объект.бит_ПричинаЗаниженияНормыВыпуска = Неопределено;
		Объект.бит_ПричинаЗаниженияНормыВремени = Неопределено;
		Объект.бит_Выполнено100ПроцентовВыпуска = Неопределено;
		Объект.бит_Выполнено100ПроцентовВремени = Неопределено;
		
	КонецЕсли;
	 	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ВыходныеИзделияПриИзмененииПосле(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] +        
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.Выполнена") Тогда
		РасчитатьПроцентВыполнениеПоВыпуску();
	КонецЕсли;
	Объект.бит_Транслировано = Ложь; 	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ВремяВыполненияПриИзмененииПосле(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] +        
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.Выполнена") Тогда
		РасчитатьПроцентВыполнениеПоВремени();
	КонецЕсли;
	 	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ВремяВыполненияЕдИзмПриИзмененииПосле(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] +        
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.Выполнена") Тогда
		РасчитатьПроцентВыполнениеПоВремени();
	КонецЕсли;
	 	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] -
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРеквизитСсылкиОбъекта(ИмяРеквизита)
	Возврат Объект.Ссылка[ИмяРеквизита];
КонецФункции

&НаСервере
Процедура РасчитатьПроцентВыполнениеПоВыпуску()
		
	// {{ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] +        
	
	//2. Реквизит "(бит)Выполнение по выпуску, %" должен пересчитываться в следующих случаях:
	//
	//Изменение поля "(бит)Количество план" в статусе документа "Выполнено"
	//Изменение "ТЧ "Выходные изделия" в статусе документа "Выполнено"
	//Изменение статуса документа на "Выполнено" с любого другого статуса
	//Формула расчета реквизита:  "(бит)Выполнение по выпуску, %" = ВЫХОД ГП/ "(бит)Количество план"*100
	
	ВыходГП = 0;
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ВидНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
	ТЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТЗ.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	
	Для Каждого СтрокаТЗ Из Объект.ВыходныеИзделия Цикл
		
		НоваяСтрокаТЗ = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ, СтрокаТЗ);
		
		НоваяСтрокаТЗ.ВидНоменклатуры = СтрокаТЗ.Номенклатура.ВидНоменклатуры;
		
		Если ЗначениеЗаполнено(СтрокаТЗ.Упаковка) Тогда
			НоваяСтрокаТЗ.ЕдиницаИзмерения = СтрокаТЗ.Упаковка; 
		Иначе                                                  
			НоваяСтрокаТЗ.ЕдиницаИзмерения = СтрокаТЗ.Номенклатура.ЕдиницаИзмерения;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.ВидНоменклатуры КАК ВидНоменклатуры,
		|	ТЗ.Количество КАК Количество,
		|	ТЗ.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ вт_ТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(вт_ТЗ.Количество) КАК Количество,
		|	вт_ТЗ.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	вт_ТЗ КАК вт_ТЗ
		|ГДЕ
		|	вт_ТЗ.ВидНоменклатуры В(&ВидНоменклатуры)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ТЗ.ЕдиницаИзмерения";
	
	ВидНоменклатуры = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ВидыНоменклатурыГотовойПродукцииВПроизводственнойОперации, ЭтотОбъект);
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВыходГП = ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла; 
	
	Если  Объект.бит_КоличествоПлан <> 0 Тогда
		Объект.бит_ВыполнениеПоВыпускуПроцент = ВыходГП / Объект.бит_КоличествоПлан * 100; 
	Иначе
		Сообщить("Нельзя расчитать процент выполнения по выпуску, т.к. ""Количество план"" равно 0!");
	КонецЕсли;                                                                                       
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] -	
	
КонецПроцедуры

&НаСервере
Процедура РасчитатьПроцентВыполнениеПоВремени()
		
	// {{ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] +        
	
	//3. Реквизит "(бит)Выполнение по времени, %" должен пересчитываться в следующих случаях:
	//
	//Изменение поля "(бит)Время выполнения план" в статусе документа "Выполнено"
	//Изменение поля "Время выполнения" или его единицы измерения в статусе документа "Выполнено"
	//Изменение статуса документа на "Выполнено" с любого другого статуса
	//Формула расчета реквизита:  "(бит)Выполнение по времени, %" = "Время выполнения" / "(бит)Время выполнения план"*100                                                                                     
	
	Если  Объект.бит_ВремяВыполненияПлан <> 0 Тогда
		Объект.бит_ВыполнениеПоВремениПроцент = Объект.ВремяВыполнения / Объект.бит_ВремяВыполненияПлан * 100; 
	Иначе
		Сообщить("Нельзя расчитать процент выполнения по времени, т.к. ""Время выполнения план"" равно 0!");
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] -	
	
КонецПроцедуры  

&НаКлиенте
Процедура Выполнено100ПроцентовВыпускаПриИзменении(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] +        
	
	//6. При установке реквизита "(бит)Выполнено100ПроцентовВыпуска" = Истина требуется установить значение поля 
	//"(бит)Выполнение по выпуску, %" = 100, при установке "Ложь" пересчитывать по п.2
	
	Если Объект.бит_Выполнено100ПроцентовВыпуска Тогда
		Объект.бит_ВыполнениеПоВыпускуПроцент = 100;
	Иначе
		Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.Выполнена") Тогда 
			РасчитатьПроцентВыполнениеПоВыпуску();
		Иначе
			Объект.бит_ВыполнениеПоВыпускуПроцент = 0;
		КонецЕсли;
	КонецЕсли;
	 	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] -
	
КонецПроцедуры

&НаКлиенте
Процедура Выполнено100ПроцентовВремениПриИзменении(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] +        
	
	//7. При установке реквизита "(бит)Выполнено100ПроцентовВремени" = Истина требуется установить значение поля 
	//"(бит)Выполнение по времени, %" = 100 , при установке "Ложь" пересчитывать по п.3
	
	Если Объект.бит_Выполнено100ПроцентовВремени Тогда
		Объект.бит_ВыполнениеПоВремениПроцент = 100;
	Иначе
		Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.Выполнена") Тогда
			РасчитатьПроцентВыполнениеПоВремени();
		Иначе
			Объект.бит_ВыполнениеПоВремениПроцент = 0;
		КонецЕсли;
	КонецЕсли;
	 	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] -
	
КонецПроцедуры

&НаСервере
Процедура бит_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [04.11.2025 17:04:00] +  
	Если Элементы.Найти("ВыходныеИзделиябит_Тара") = Неопределено Тогда
		мРеквизиты = Новый Массив;
		мРеквизиты.Добавить(Новый РеквизитФормы("бит_Тара", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"), "Объект.ВыходныеИзделия" , "(бит) Тара")); 
		ИзменитьРеквизиты(мРеквизиты);	
		//
		НоваяКолонка = Элементы.Добавить("ВыходныеИзделиябит_Тара", Тип("ПолеФормы"), Элементы.ВыходныеИзделия); 
	    НоваяКолонка.Заголовок = "(бит) Тара"; 
		НоваяКолонка.ПутьКДанным = "Объект.ВыходныеИзделия.бит_Тара";
	    НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;    
		НоваяКолонка.ТолькоПросмотр = Истина;
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [04.11.2025 17:04:00] -
КонецПроцедуры

&НаКлиенте
Процедура бит_ПриОткрытииПосле(Отказ)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [04.11.2025 18:06:14] +   	
	
	//ЭтаФорма.Модифицированность = Ложь;	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [04.11.2025 18:06:14] -
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаруНаСервере(ЗаказКлиента)
    // {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [14.11.2025 14:10:16] +        
	Если ЗначениеЗаполнено(ЗаказКлиента) и ТипЗнч(ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") Тогда        
		ТоварыЗаказа = ЗаказКлиента.Товары.Выгрузить(, "Номенклатура, бит_Тара");
		Для каждого стр из Объект.ВыходныеИзделия Цикл
			СтрокаТоваровЗаказа = ТоварыЗаказа.Найти(стр.Номенклатура, "Номенклатура");
			Если СтрокаТоваровЗаказа <> Неопределено Тогда
				стр.бит_Тара = СтрокаТоваровЗаказа.бит_Тара;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для каждого стр из Объект.ВыходныеИзделия Цикл
			стр.бит_Тара = стр.Номенклатура.бит_СтандартныйТипТары;
		КонецЦикла;
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [14.11.2025 14:10:16] -
КонецПроцедуры


&НаСервере
Процедура бит_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [01.12.2025 16:29:29] +   
	Если Элементы.Найти("ВыходныеИзделиябит_Тара") = Неопределено Тогда
		мРеквизиты = Новый Массив;
		мРеквизиты.Добавить(Новый РеквизитФормы("бит_Тара", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"), "Объект.ВыходныеИзделия" , "(бит) Тара")); 
		ИзменитьРеквизиты(мРеквизиты);	
		//
		НоваяКолонка = Элементы.Добавить("ВыходныеИзделиябит_Тара", Тип("ПолеФормы"), Элементы.ВыходныеИзделия); 
	    НоваяКолонка.Заголовок = "(бит) Тара"; 
		НоваяКолонка.ПутьКДанным = "Объект.ВыходныеИзделия.бит_Тара";
	    НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;    
		НоваяКолонка.ТолькоПросмотр = Истина;
	КонецЕсли;
	ЗаказКлиента = Заполнить_бит_КомментарийЗаказаКлиента(Ложь);
	ЗаполнитьТаруНаСервере(ЗаказКлиента);
	// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [01.12.2025 16:29:29] -
КонецПроцедуры
